{
    "scopus-eid": "2-s2.0-84933504316",
    "originalText": "serial JL 312041 291210 291801 31 90 Advances in Climate Change Research ADVANCESINCLIMATECHANGERESEARCH 2014-12-19 2014-12-19 2015-02-20T12:58:19 1-s2.0-S1674927814000082 S1674-9278(14)00008-2 S1674927814000082 10.1016/j.accre.2014.08.001 S300 S300.2 FULL-TEXT 1-s2.0-S1674927815X00025 2015-05-15T07:03:33.727831-04:00 0 0 20140901 20140930 2014 2014-12-19T17:40:00.029325Z articleinfo articletitlenorm authfirstinitialnorm authfirstsurnamenorm cid cids contenttype copyright crossmark dateloaded dateloadedtxt datesearch datesort dateupdated dco docsubtype doctype doi eid ewtransactionid hubeid indexeddate issfirst issn issnnorm issuelist itemstage itemtransactionid itemweight oauserlicense openaccess openarchive pg pgfirst pglast pii piinorm pubdateend pubdatestart pubdatetxt pubyr sectiontitle sortorder srctitle srctitlenorm srctype ssids alllist content oa subj subheadings tomb volfirst volissue volumelist webpdf webpdfpagecount yearnav figure table body mmlmath acknowledge affil articletitle auth authfirstini authfull authkeywords authlast footnotes grantnumber grantsponsor primabst ref 1674-9278 16749278 true 5 5 3 3 Volume 5, Issue 3 6 142 148 142 148 201409 September 2014 2014-09-01 2014-09-30 2014 Policy fora article fla Copyright © 2014 The Authors. Production and hosting by Elsevier B.V. on behalf of KeAi ESTABLISHINGFAIRALLOCATIONINTERNATIONALAVIATIONCARBONEMISSIONRIGHTS ZHAO F 1 Introduction 2 The principle of fair international aviation carbon emission rights allocation 3 Measurement of the historical fairness of international aviation carbon emissions rights 4 A fair allocation scheme for international aviation CO2 emission rights 4.1 Model building 4.2 Allocation method for international aviation CO2 emission rights 4.3 Example application of the allocation method 5 Conclusions and discussions Acknowledgements References BAER 2008 P GREENHOUSEDEVELOPMENTRIGHTSFRAMEWORK CHEN 2012 Y PRINCIPLESINITIALALLOCATIONCARBONEMISSIONRIGHTS GRUBLER 1991 1397 1416 A HALVERSON 2007 247 265 A HE 2009 362 368 J HEIL 2000 163 181 M ICAOINTERNATIONALCIVILAVIATIONORGANIZATION 2010 ICAOENVIRONMENTALREPORT2010AVIATIONCLIMATECHANGE ICAOINTERNATIONALCIVILAVIATIONORGANIZATION 2013 ICAOENVIRONMENTALREPORT2013AVIATIONCLIMATECHANGE LIU 2008 268 272 D LIU 2004 15 16 Y LU 2013 M RESEARCHFAIRNESSRIGHTINTERNATIONALALLOCATIONCARBONEMISSIONS PAN 2009 6 16 J RINGIUS 2002 1 22 L TENG 2010 449 455 F WANG 2011 329 334 X WU 2009 1269 1274 C WU 2006 66 70 Y YANG 2010 25 29 Z ZHENG 2002 94 100 S ZHENG 2011 69 90 Y ZHAOX2014X142 ZHAOX2014X142X148 ZHAOX2014X142XF ZHAOX2014X142X148XF Full 2014-11-27T19:38:42Z Author http://creativecommons.org/licenses/by-nc-nd/3.0/ OA-Window item S1674-9278(14)00008-2 S1674927814000082 1-s2.0-S1674927814000082 10.1016/j.accre.2014.08.001 312041 2015-02-20T09:12:26.584642-05:00 2014-09-01 2014-09-30 1-s2.0-S1674927814000082-main.pdf https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1674927814000082/MAIN/application/pdf/f97cf52c16a042790de1135a817f8c77/main.pdf https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1674927814000082/MAIN/application/pdf/f97cf52c16a042790de1135a817f8c77/main.pdf main.pdf pdf true 416801 MAIN 7 1-s2.0-S1674927814000082-main_1.png https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1674927814000082/PREVIEW/image/png/f0080c2dd8c90449811f6e94451c3d1e/main_1.png https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1674927814000082/PREVIEW/image/png/f0080c2dd8c90449811f6e94451c3d1e/main_1.png main_1.png png 48924 849 656 IMAGE-WEB-PDF 1 1-s2.0-S1674927814000082-si5.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1674927814000082/STRIPIN/image/gif/9b2d2dc955dca257676a9db4521b6af9/si5.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1674927814000082/STRIPIN/image/gif/9b2d2dc955dca257676a9db4521b6af9/si5.gif si5 si5.gif gif 1510 65 273 ALTIMG 1-s2.0-S1674927814000082-si4.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1674927814000082/STRIPIN/image/gif/c005b7c51b2387cc8a796d619927ab18/si4.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1674927814000082/STRIPIN/image/gif/c005b7c51b2387cc8a796d619927ab18/si4.gif si4 si4.gif gif 1377 80 195 ALTIMG 1-s2.0-S1674927814000082-si3.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1674927814000082/STRIPIN/image/gif/d6a4f8a1c29ffb8b6e9c7ef97afee678/si3.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1674927814000082/STRIPIN/image/gif/d6a4f8a1c29ffb8b6e9c7ef97afee678/si3.gif si3 si3.gif gif 566 17 165 ALTIMG 1-s2.0-S1674927814000082-si2.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1674927814000082/STRIPIN/image/gif/01e9d33f23f6e3018d52008debb0b183/si2.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1674927814000082/STRIPIN/image/gif/01e9d33f23f6e3018d52008debb0b183/si2.gif si2 si2.gif gif 1389 41 333 ALTIMG 1-s2.0-S1674927814000082-si1.gif https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1674927814000082/STRIPIN/image/gif/1b7359f860269bc96757b490dbfa4103/si1.gif https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1674927814000082/STRIPIN/image/gif/1b7359f860269bc96757b490dbfa4103/si1.gif si1 si1.gif gif 697 32 193 ALTIMG 1-s2.0-S1674927814000082-gr1.jpg https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1674927814000082/gr1/DOWNSAMPLED/image/jpeg/b64ae6dca6bb9800eecb7ad9b4e11167/gr1.jpg https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1674927814000082/gr1/DOWNSAMPLED/image/jpeg/b64ae6dca6bb9800eecb7ad9b4e11167/gr1.jpg gr1 gr1.jpg jpg 42651 374 544 IMAGE-DOWNSAMPLED 1-s2.0-S1674927814000082-gr1.sml https://s3.amazonaws.com/prod-ucs-content-store-us-east/content/pii:S1674927814000082/gr1/THUMBNAIL/image/gif/e55bc0b30cedd60d85c6ca54edd92ae6/gr1.sml https://s3-eu-west-1.amazonaws.com/prod-ucs-content-store-eu-west/content/pii:S1674927814000082/gr1/THUMBNAIL/image/gif/e55bc0b30cedd60d85c6ca54edd92ae6/gr1.sml gr1 gr1.sml sml 5561 150 219 IMAGE-THUMBNAIL ACCRE 7 S1674-9278(14)00008-2 10.1016/j.accre.2014.08.001 The Authors Fig. 1 Carbon Lorenz curve of international aviation CO2 accumulative emissions from 1971 to 2011. Table 1 International aviation CO2 emissions per capita in 2011, including the top 20 countries in 2011. Area Emissions (Mt CO2) Population (million) Emissions per capita (t CO2) Ranking 28 EU members 131.21 507.78 0.26 7 United States 64.72 312.04 0.21 10 China 35.79 1,351.20 0.03 19 Russia 19.04 141.93 0.13 13 Singapore 18.33 5.18 3.54 1 Japan 18.30 127.83 0.14 12 India 12.23 1,241.49 0.01 20 Thailand 12.02 69.52 0.17 11 Korea 11.99 49.78 0.24 8 Australia 10.17 22.76 0.45 5 United Arab 9.80 7.89 1.24 3 Mexico 8.12 109.22 0.07 15 Malaysia 7.58 28.86 0.26 6 Saudi Arabia 6.63 28.08 0.24 9 Brazil 6.36 196.66 0.03 18 Qatar 4.66 1.87 2.49 2 Switzerland 4.47 7.87 0.57 4 Canada 3.60 34.48 0.10 14 Iran 3.55 74.80 0.05 16 Turkey 3.45 73.95 0.05 17 Date source: CO2 Emissions from Fuel Combustion (2013 Edition), IEA, Paris. Note: The 28 EU members are as a whole, and the data from China include Hong Kong and Macau, but not Taiwan. In 2011, these countries account for 84% of total global CO2 emissions. Table 2 Historical international aviation cumulative CO2 emissions per capita during 1971–2011, including the top 20 countries. Area Cumulative emissions (Mt CO2) Percentage (%) Population in 2011 (million) Cumulative emissions per capital (t CO2) Ranking 28 EU members 3208.17 32.33 507.78 6.32 8 Russia 1,731.22 17.45 141.93 12.20 4 United States 1,636.07 16.49 312.04 5.24 9 Japan 508.31 5.12 127.83 3.98 11 China 437.93 4.41 1,351.20 0.32 19 Singapore 290.29 2.93 5.18 56.00 1 United Arab 246.69 2.49 7.89 31.26 2 Thailand 244.44 2.46 69.52 3.52 12 Mexico 233.13 2.35 109.22 2.13 15 Australia 199.49 2.01 22.76 8.76 6 India 188.24 1.90 1,241.49 0.15 20 Saudi Arabia 181.98 1.83 28.08 6.48 7 Iran 127.41 1.28 74.80 1.70 16 Switzerland 123.79 1.25 7.87 15.73 3 Korea 123.36 1.24 49.78 2.48 14 Malaysia 121.39 1.22 28.86 4.21 10 Israel 91.41 0.92 7.76 11.77 5 Canada 90.60 0.91 34.48 2.63 13 Brazil 75.40 0.76 196.66 0.38 18 South Africa 62.96 0.63 50.59 1.24 17 Date source: CO2 Emissions from Fuel Combustion (2013 Edition), IEA, Paris. Note: The 28 EU members are considered as a whole. The data for Russia are based on those for the Former Soviet Union from 1971 to 1989. The data for Korea are from 1973 to 2011, and the data for Brazil are from 1977 to 2011. The data for China include Hong Kong and Macau, but not Taiwan. The areas included in this table account for 85% of the total carbon emissions. Table 3 The allocation results of international aviation CO2 emission reductions in 2021. Area Emission reductions (Mt CO2) Proportion of total emission reductions (%) Proportion of total emissions in 2021 (%) Proportion of emission reductions in 2020 (%) 28 EU members 5.24 26.6 24.2 3.4 Russia 0.61 3.1 4.2 2.4 United States 3.61 18.3 12.7 4.6 Japan 1.12 5.7 2.8 6.2 China 2.11 10.7 14.2 2.5 Singapore 0.65 3.3 4.5 3.3 United Arab 0.41 2.1 1.5 2.3 Thailand 0.41 2.1 2.6 3.3 Mexico 0.36 1.8 1.3 4.4 Australia 0.37 1.9 2.0 2.9 India 0.62 3.1 4.7 2.2 Saudi Arabia 0.22 1.1 1.2 2.8 Iran 0.13 0.6 0.7 2.8 Switzerland 0.17 0.9 0.7 3.8 Korea 0.52 2.6 2.3 3.6 Malaysia 0.16 0.8 1.7 2.0 Israel 0.09 0.5 0.5 3.1 Canada 0.25 1.3 0.6 6.2 Brazil 0.36 1.8 3.6 1.8 South Africa 0.11 0.6 0.4 2.3 Peer review under responsibility of National Climate Center (China Meteorological Administration). Establishing the fair allocation of international aviation carbon emission rights Feng-Cai Zhao Li-Gang Yin ∗ Lan Gao Economics and Management College, Civil Aviation University of China, Tianjin 300300, China Economics and Management College Civil Aviation University of China Tianjin 300300 China ∗ Corresponding author. To identify potentially unfair use of international aviation carbon emission rights in different countries, this paper presents a carbon Lorenz curve and Gini coefficient, constructed on the basis of historical cumulative international aviation CO2 emissions per capita. The study follows a methodology adapted from the research into fair income allocation. The results of these calculations show that there has been vast unfairness surrounding international aviation carbon emissions in the past, and that this unfairness has been partially hidden by a delay in accumulative start dates. A solution to this problem, allowing fair allocation of carbon emissions, is the key to building a mechanism for the reduction of global international aviation emissions. This study proposes a fair method for allocating emission rights, based on a responsibility-capacity index. Taking a goal of carbon-neutral growth by 2020 as an example, the degree of carbon emission reduction expected from different countries by 2021 is calculated using the proposed method. Keywords Aviation carbon emission rights Fair allocation Carbon Lorenz curve Carbon Gini coefficient Responsibility-capacity index 1 Introduction Carbon emissions from the aviation industry currently account for 2.0%–2.5% of global yearly anthropogenic carbon emissions. Following the rising demand and rapid growth in the aviation industry, emissions from this sector have increased by 98% from 1990 to 2006, and are expected to account for 10% of global greenhouse gas emissions caused by human activities by 2050 unless measures are taken (ICAO, 2010). As a major source of upper-air greenhouse gases, the aviation industry is faced with enormous pressure to reduce emissions. However, the aviation industries of different countries are currently at different stages of their development cycles, and the total international aviation carbon emissions differ considerably from the carbon emissions per capita in different countries. These differences may be solidified by unfair allocation schemes, which can lead to market distortion in the development of national aviation industries. Therefore, with the rights of aviation carbon emissions becoming increasingly limited, it is now imperative that a method is developed to measure and evaluate the fairness of the allocation of international aviation emission rights and thereby distribute aviation carbon emission rights in a fair and reasonable way. The issue of fairness of carbon emission rights among different countries has been strongly debated since at least 1992, when the United Nations Framework Convention on Climate Change treaty was signed. Over the past hundred years, developed countries have typically generated a large number of carbon emissions as a result of industrialization, while developing countries have historically generated fewer emissions, although this is expected to increase in response to future industrial development. Therefore, the intentionally fair principle of common but differentiated responsibilities and respective capabilities was proposed as part of the United Nations Framework Convention on Climate Change, signed in 1992 and the Kyoto Protocol, signed in 1997. However, due to differences in interests and interpretations by different countries, agreement on the specific meaning and applicability of this fairness has yet to be reached by the international community. In current international aviation market-based mechanism schemes, including both the existing European Union Greenhouse Gas Emission Trading Scheme or the preliminary market-based mechanism scheme of the International Civil Aviation Organization, the allocation of carbon emission rights is mainly dominated by developed countries, and the fair allocation of the responsibilities and obligations of aviation emission rights for all countries remains a major focus of debate. Thus, research into the fairness of international aviation carbon emission rights allocations is crucial. 2 The principle of fair international aviation carbon emission rights allocation The principle of fair international aviation carbon emission rights incorporates different aspects, including justice, equality, and equity. The principle involves two major types of fairness, intra-generational fairness and inter-generation fairness (Chen, 2012; Zheng and Liang, 2011; Lu, 2013; Pan and Zheng, 2009). Intra-generational fairness refers to equal rights in the demand for a good living environment and the use of natural resources among people of the same generation, regardless of any differences in nationality, race, gender, level of economic development, and culture (Zheng, 2002). Historically and presently, intra-generational unfairness of environmental issues is seen as an extremely serious problem. Through a calculation of the international aviation CO2 emissions per capita, there are huge differences in CO2 emissions of different countries, and especially between developed and developing countries; this leads to intra-generational unfairness. The top 20 countries for CO2 emissions in 2011 are listed in Table 1 , which shows significant differences between the CO2 emissions of different countries. For example, emissions per capita of the United States are seven times those of China, and those of European Union are nine times those of China. Intra-generational fairness is closely related to the level of economic development and should be translated into equal aviation carbon emission rights for all. In contrast, inter-generational fairness refers to equal rights in the use of natural resources, enjoying a clean environment, and ensuring the survival and development of current and future generations. In essence, it is a problem rooted in the inter-generational allocation of natural resources (Wu et al., 2009; Grübler and Fujii, 1991). Historical changes in the emission responsibilities of developed countries should be considered when considering inter-generational fairness. Despite the relatively recent development of the international aviation industry, there have always been large gaps in cumulative emissions between different countries, and these differences are even larger between the cumulative emissions per capita. Table 2 shows the top 20 international aviation cumulative CO2 emissions per capita during 1971–2011. The international aviation historical cumulative CO2 emissions per capita of the United States are 16 times those of China, and those of the European Union are approximately 20 times those of China, thus indicating serious inter-generational unfairness in international aviation CO2 emissions. This disparity is closely related to the relative stages of economic and aviation development in different countries. As the economy and aviation industry was established earlier in developed countries, their historical emissions are higher than those in developing countries. In contrast, the historical emissions of developing countries are currently relatively low, but may be expected to grow rapidly in the future. Therefore, the historical emission responsibilities of developed countries and the future growth in demand for emissions for developing countries should be fully considered when allocating aviation emission rights. There are two important principles guiding the fair allocation of carbon emission rights (Ringius et al., 2002; He et al., 2009). First is the principle of culpability, measured by the role the relevant parties play upon causing a problem. Thus, according to the principle of culpability, if a problem is created by the actions of a person, it is a fair practice that the responsibility to solve the problem lies with that person. Second is the principle of payment capability, in which fairness demands that the behavioral subjects take responsibility for undesirable effects according to their different capabilities. In the context of the present study, the principle of culpability requires the responsibility of historical emissions to be taken into account, while the principle of payment capability considers the present national conditions of different countries. Thus, considerations of the fairness of international aviation carbon emission rights allocation must incorporate intra-generational fairness and inter-generational fairness, in addition to the principle of culpability and the principle of payment capability. Intra-generational fairness requires consideration of the fairness of international aviation emissions per capita, while inter-generational fairness includes the fairness of historical international aviation emissions. The principle of culpability requires consideration of historical responsibility, while the principle of payment capability considers the developmental levels of different countries’ economies and aviation industries, and in particular the aviation emission rights of developing countries. 3 Measurement of the historical fairness of international aviation carbon emissions rights The Gini coefficient was defined by Italian economist Corrado Gini in the early 20th century as an index to judge the fairness of income allocation according to a Lorenz curve (Liu and Chen, 2008; Wang et al., 2011; Liu et al., 2004). In essence, the Gini coefficient represents a quantitative analysis of allocation uniformity. Therefore, in addition to being used for analyzing the fairness of social wealth allocation in economics, the Gini coefficient can be used for any allocation uniformity analysis in other subjects. For example, Wu et al. (2006) used the Gini coefficient in a study allocating the total amount of water pollutants, Teng et al. (2010) used it when measuring carbon equity, while Heil and Wodon (2000) applied it to the measurement of inequality in CO2 emissions. Using the Gini coefficient to quantify fairness, this paper seeks to assess the fair allocation of international aviation carbon emission rights. We use historical international aviation cumulative CO2 emissions per capita as an index to construct the carbon Gini coefficient of international aviation CO2 emissions, and to measure the fairness of possession and use of international aviation carbon emission rights in the past. The carbon Lorenz curve (Fig. 1 ) is first constructed using historical international aviation cumulative CO2 emissions per capita data (shown in Table 2), which directly illustrates the unfairness of possession and use of limited international aviation carbon emission rights by different countries over time. In Fig. 1, countries are listed in ascending order of cumulative emissions per capita. The abscissa represents the accumulative percentage of population in 2011. The ordinate represents the accumulative percentage of international aviation CO2 accumulative emissions from 1971 to 2011. On the basis of the Lorenz curve, this paper uses an area-based calculation method to calculate the Gini coefficient of international aviation CO2 emissions. Setting the area between the actual allocation curve and the absolute fair allocation curve as X, and the area below the actual allocation curve as Y, the Gini coefficient (G) is equal to X/(X+Y), and thus the calculation formula is: (1) G = X X + Y = 0.5 − Y 0.5 = 1 − 2 Y . Supposing there are a total of n countries, then Y can be divided into n trapezoids. The sum of the areas of all those trapezoids is approximately the area of Y, (2) Y = ∑ j = 1 n ( C j − 1 + C j ) ( P j − P j − 1 ) 2 = 1 2 ∑ j = 1 n ( C j − 1 + C j ) Δ P j , where P j and C j are the abscissa and the ordinate of country j, respectively, and ΔP j is the percentage of the population of country j. In this way, Y calculated from this formula will be very close to the true value when n is very large. Generally, a Gini coefficient of 0.4 is used internationally as a warning line of an allocation gap. The calculation result in this case shows that there is a wide gap in allocation, as the Gini coefficient of international aviation CO2 emissions is 0.68, which is far beyond the warning line. This result also indicates that 68% of the international aviation carbon emission rights were distributed unfairly in the past, and that the majority were overrepresented by developed countries. The choice of starting year is a crucial decision in the measurement of the fairness of international aviation CO2 emissions. Most studies (Yang, 2010; Halverson, 2007) have shown that the earlier the starting year, the greater the degree of unfairness. However, there have been no quantitative studies about the impact of different starting years on changing historical responsibilities. This paper attempts to use the carbon Lorenz curve and Gini coefficient of international aviation emissions to analyze the impact of choosing different starting years on the calculation of historical responsibilities. Using 1990 and 2005 as starting years, the Gini coefficients of international aviation CO2 emissions are found to be 0.63 and 0.60 respectively. With a delay in the accumulative starting year, the value of the carbon Gini coefficient reduces, and the historical unfairness of international aviation CO2 emissions of different countries may be hidden. 4 A fair allocation scheme for international aviation CO2 emission rights Considering the aspects and principles of fairness, and using the allocation method for greenhouse gas rights proposed by Baer et al. (2008) for reference, this paper presents a novel fair method of allocating international aviation CO2 emission rights. 4.1 Model building As discussed above, a fair allocation scheme should consider both historical emission responsibilities and current capacities for emission reduction. Considering these elements, a responsibility-capacity index is designed, in which the respective responsibility and capacity of different countries can be reflected. (3) I = R a × C b ( 0 ≤ a , b ≤ 1 ) , where R is the historical responsibility of international aviation emissions; C represents the emission reduction capacity. a and b are the weights of R and C, respectively, which contributes to I and varies with different values. In reality, their values are determined by negotiation between all parties. When a = b, responsibility and capacity have equal weight. The index of historical international aviation cumulative CO2 emissions per capita can reflect the historical responsibility of different countries, and Table 2 shows that developed countries have higher historical cumulative CO2 emissions per capita, indicating that developed countries have greater historical responsibilities. In comparison, the emission reduction capacity of a country has a close relationship with its economic, scientific and technological developmental stage, and GDP per capita can be used as an indicator to largely reflect this stage (ICAO, 2013). Thus, this paper uses historical international aviation cumulative CO2 emissions per capita and GDP per capita as the two parameters R and C, when calculating I. 4.2 Allocation method for international aviation CO2 emission rights First, an emission reduction target should be set, which will guide the control of international aviation CO2 emission rights (ΔE). To achieve the international aviation emission objective, taking the goal of carbon-neutral growth by 2020, meaning that international aviation will maintain a constant, zero net growth from 2020, as an example, each country must take measures to reduce international aviation CO2 emissions. Second, the responsibility-capacity index for each country should be calculated. As the emission reduction obligation is to be set for the year following the current year, GDP, population, and international aviation CO2 emission data are as yet unavailable, therefore the two parameters needed for calculating the responsibility-capacity index will be set by data from the year before the allocating year. This is designed so that a time difference will have minimal impact on allocation results. The following represents the calculating formula for country j in allocating year t. (4) I j = ( ∑ i = t 0 t − 1 E j , i P j , t − 1 ) a ( G D P j , t − 1 P j , t − 1 ) b , where t 0 is the starting year of the accumulative calculation, t−1 is the year before the allocating year t, E j,i represents the international aviation emissions of country j in year i, and P j,t−1 and GDP j,t−1 are the population and GDP of country j in year t−1 respectively. The calculation of responsibility-capacity index is a dynamic process, allowing the historical emission responsibility and the future emission reduction capacity to be fully taken into consideration. Finally, the amount of emission reduction expected for different countries can be calculated. The emission reduction quantity of country j in allocating year t is calculated by relative proportion of each country. The formula is as follows: (5) Δ E j = I j ∑ I P j , t − 1 ∑ ( I j ∑ I P j , t − 1 ) Δ E = I j P j , t − 1 ∑ ( I j P j , t − 1 ） Δ E . 4.3 Example application of the allocation method As an example, this paper employs the above method to fairly allocate international aviation CO2 emission rights for the year 2021. First, we determine the global emission reduction target and the emission reduction quantity. Supposing that the global emission goal is for carbon-neutral growth by 2020, the emission reduction quantity ΔE is increased in 2021 relative to 2020. According to the forecast, the global international aviation CO2 emissions are currently 620.27 Mt 1 1 In reality these data are already known. This article uses 3.17%, which is the average growth rate of 2001–2011 based on the data of CO2 Emissions from Fuel Combustion (2013 Edition), as the annual growth rate after 2011. , and taking 3.17% as the annual growth rate of global international aviation CO2 emissions. So ΔE = 620.27 × 3.17% = 19.66 Mt. Second, we calculate I j for each country. The allocating year is therefore t = 2021, and the GDP and the population in the year 2020 are used as data for GDP j,t−1 and P j,t−1 for each country 2 2 The data of population and GDP are forecast based on the average growth rate for 2001–2011. GDP is quoted relative to 2005 exchange rates (billion$ 2005). . Taking the start year t 0 = 1990 as an example, the international aviation emissions of each country are derived from IEA data 3 3 The emissions data for these areas from 2012 to 2020 are forecasts based on the average growth rate during 2001–2011. We suppose that the result of negotiation between all parties provides values of parameters a and b such that a = b = 0.5. Then, I j of the different countries can be calculated using Eq. (4). Further, the amount of international aviation emission reduction ΔE j , for each country, can be calculated by Eq. (5). From these calculations, the allocation results of some major countries are listed in Table 3 . The emission reduction allocated to China is 2.11 Mt CO2, while the predicted total international aviation emissions of China are 82.96 Mt CO2 in 2021; this represents a proportional reduction of 2.3%. Relative to the total global international aviation emission reduction in 2021, the proportion of emission reduction allocated to China is 10.7%, which is less than the proportion of China's international aviation emissions relative to the global emissions in 2021, which is 14.2%. Further, the results shows that the emission reduction allocated to China is less than that allocated based on the actual emission ratio in future years. Considering the amount that emissions will increase in future, the proportion of obligation given to China is comparatively lower. Meanwhile, a 2.11 Mt emission reduction accounts for 2.5% of emissions in 2020, which means that if the growth rate of China's international aviation emissions is reduced by just 2.5%, it will be able to achieve its emission reduction goal. The average annual growth rate of international aviation emissions in China was 9.8% between 2001 and 2011, following the development of international aviation in China; the growth rate after 2021 is predicted to be between 3.2% and 6%, which will be slightly lower than twice the average global growth rate. Supposing that the emission growth rate of China is 6% under unrestricted conditions, then the growth rate of China in 2021 should be controlled such that 6%−2.5% = 3.5%, according to this scheme. Although this still represents a significant pressure on the aviation industry of China, a growth rate of 3.5% can still be maintained, in contrast to most of the major developed countries, which must have a negative emission growth to accomplish their emission reduction objectives. Therefore, in this case the emission reduction responsibility for China is lower than that of the major developed countries. 5 Conclusions and discussions This paper aimed to analyze the fairness of international aviation emission rights allocation, based on aspects of inter-generational and intra-generational fairness, as well as the principles of culpability and payment capability. Using a previously developed approach for analyzing fair income allocation as reference, we constructed a carbon Lorenz curve and Gini coefficient for historical international aviation cumulative CO2 emissions per capita, and used them as criteria for quantifying the unfairly allocation and use of international aviation emission rights in the past. The results show that there has been considerable unfairness in international aviation carbon emissions in the past. For example, taking 1971 as an accumulative starting year, approximately 68% of international aviation emission rights are unfairly allocated. The carbon Gini coefficient indicates that the unfairness is partially hidden by a delay in the accumulative start date. Furthermore, we constructed a responsibility-capacity index based on the historical international aviation cumulative CO2 emissions per capita and GDP per capita, and proposed a method of allocating international aviation emission rights. Taking the goal of carbon-neutral growth by 2020 as an example, we used the proposed method to calculate the amount of carbon emission reduction necessary from different countries in 2021. A worked example showed that the emission reduction allocated to China is 2.11 Mt in 2021, accounting for 10.7% of the global emission reduction in that year, which represents a considerable pressure on the fast growing aviation industry of China. The allocation scheme for international aviation emission rights proposed in this paper only considers the principles of fairness, without considering the specific circumstances and respective capacities of some countries, such as island countries that mainly rely on air transportation to travel to and from between landmasses. Most of these island countries have higher historical cumulative CO2 emissions per capita, and the proposed allocation scheme will undoubtedly increase their transportation costs. In addition, the responsibility-capacity index incorporates only the GDP per capita as an emission reduction capacity indicator, but this does not fully reveal the economic differences between countries. Therefore, due to the fact that emission reduction technologies are mainly available to only a few developed countries, the allocation scheme of international aviation emission rights should consider the specific national demands for air transportation, as well as the differences in emission reduction technology in different countries, and should be amended using relevant correction coefficients. In summary, the allocation of international aviation emission reduction obligations is a complicated and difficult task, and further and more in-depth research into fairness, rationality, and feasibility is needed. Acknowledgements This study was sponsored by the China Clean Development Mechanism Fund (2012037). References Baer et al., 2008 P. Baer T. Athanasiou T. Kartha The Greenhouse Development Rights Framework 2008 Stockholm Environment Institute Stockholm Chen, 2012 Y.-Y. Chen The Principles of Initial Allocation of Carbon Emission Rights 2012 A&F University ZheJiang (in Chinese) Grübler and Fujii, 1991 A. Grübler Y. Fujii Inter-generational and spatial equity issues of carbon accounts Energy 16 1991 1397 1416 Halverson, 2007 A.M. Halverson Common, but differentiated commitments in the future climate change regime: amending the Kyoto Protocol to include Annex C and the Annex C mitigation fund Colo. J. Int. Environ. Law Policy 18 2007 247 265 He et al., 2009 J.-K. He W.-Y. Chen F. Teng Long-term climate change mitigation target and carbon permit allocation Adv. Clim. Change Res. 5 6 2009 362 368 (in Chinese) Heil and Wodon, 2000 M.T. Heil Q.T. Wodon Future in equality in CO2 emissions and the impact of abatement proposals Environ. Resource Econ. 17 2 2000 163 181 ICAO, 2010 ICAO (International Civil Aviation Organization) ICAO Environmental Report 2010: Aviation and Climate Change 2010 ICAO, 2013 ICAO (International Civil Aviation Organization) ICAO Environmental Report 2013: Aviation and Climate Change 2013 Liu and Chen, 2008 D.-D. Liu X.-H. Chen Method for evaluating the fairness of water use in Guangdong province Adv. Water Sci. 19 2 2008 268 272 (in Chinese) Liu et al., 2004 Y. Liu M. Xie Y. Ding Comparing with the Gini coefficient calculation method Stat. Decision 9 2004 15 16 (in Chinese) Lu, 2013 M.-J. Lu The Research on the Fairness of the Right of International Allocation of Carbon Emissions 2013 Hebei University of Economics and Business (in Chinese) Pan and Zheng, 2009 J.-H. Pan Y. Zheng Responsibility and individual equity for carbon emissions rights World Econ. Politics 10 2009 6 16 (in Chinese) Ringius et al., 2002 L. Ringius A. Torvanger A. Underdal Burden sharing and fairness principles in international climate policy Int. Environ. Agreements 1 2002 1 22 Teng et al., 2010 F. Teng J.-K. He X.-Z. Pan How to measure carbon equity: carbon Gini index based on historical cumulative emission per capita Adv. Climate Change Res. 6 6 2010 449 455 (in Chinese) Wang et al., 2011 X.-J. Wang J.-Y. Zhang J.-F. Liu Discussion on evaluating the fairness of domestic water use in China J. Nat. Res. 26 2 2011 329 334 (in Chinese) Wu et al., 2009 C.-F. Wu Z.-C. Yao Y.-W. Li An overview and progress of the study of environmental equity Adv. Earth Sci. 11 2009 1269 1274 (in Chinese) Wu et al., 2006 Y.-Y. Wu Y.-S. Li W.-J. Liu Study on Gini coefficient method of total pollutant load allocation for water bodies Res. Environ. Sci. 19 2 2006 66 70 (in Chinese) Yang, 2010 Z. Yang Equity of energy consumption of the carbon emissions from space based on environmental capacity EOC 32 7 2010 25 29 (in Chinese) Zheng, 2002 S.-H. Zheng Intra-generational equity on environmental law Stud. Law Business 4 2002 94 100 (in Chinese) Zheng and Liang, 2011 Y. Zheng F. Liang Principles of climate justice and the construction of international climate regime World Econ. Politics 6 2011 69 90 (in Chinese)",
    "scopus-id": "84933504316",
    "coredata": {
        "eid": "1-s2.0-S1674927814000082",
        "dc:description": "To identify potentially unfair use of international aviation carbon emission rights in different countries, this paper presents a carbon Lorenz curve and Gini coefficient, constructed on the basis of historical cumulative international aviation CO2 emissions per capita. The study follows a methodology adapted from the research into fair income allocation. The results of these calculations show that there has been vast unfairness surrounding international aviation carbon emissions in the past, and that this unfairness has been partially hidden by a delay in accumulative start dates. A solution to this problem, allowing fair allocation of carbon emissions, is the key to building a mechanism for the reduction of global international aviation emissions. This study proposes a fair method for allocating emission rights, based on a responsibility-capacity index. Taking a goal of carbon-neutral growth by 2020 as an example, the degree of carbon emission reduction expected from different countries by 2021 is calculated using the proposed method.",
        "openArchiveArticle": "false",
        "prism:coverDate": "2014-09-30",
        "openaccessUserLicense": "http://creativecommons.org/licenses/by-nc-nd/3.0/",
        "prism:aggregationType": "Journal",
        "prism:url": "https://api.elsevier.com/content/article/pii/S1674927814000082",
        "dc:creator": [
            {
                "@_fa": "true",
                "$": "Zhao, Feng-Cai"
            },
            {
                "@_fa": "true",
                "$": "Yin, Li-Gang"
            },
            {
                "@_fa": "true",
                "$": "Gao, Lan"
            }
        ],
        "link": [
            {
                "@_fa": "true",
                "@rel": "self",
                "@href": "https://api.elsevier.com/content/article/pii/S1674927814000082"
            },
            {
                "@_fa": "true",
                "@rel": "scidir",
                "@href": "https://www.sciencedirect.com/science/article/pii/S1674927814000082"
            }
        ],
        "dc:format": "application/json",
        "openaccessType": "Full",
        "pii": "S1674-9278(14)00008-2",
        "prism:volume": "5",
        "prism:publisher": "The Authors. Production and hosting by Elsevier B.V. on behalf of KeAi",
        "dc:title": "Establishing the fair allocation of international aviation carbon emission rights",
        "prism:copyright": "Copyright © 2014 The Authors. Production and hosting by Elsevier B.V. on behalf of KeAi",
        "openaccess": "1",
        "prism:issn": "16749278",
        "prism:issueIdentifier": "3",
        "dcterms:subject": [
            {
                "@_fa": "true",
                "$": "Aviation carbon emission rights"
            },
            {
                "@_fa": "true",
                "$": "Fair allocation"
            },
            {
                "@_fa": "true",
                "$": "Carbon Lorenz curve"
            },
            {
                "@_fa": "true",
                "$": "Carbon Gini coefficient"
            },
            {
                "@_fa": "true",
                "$": "Responsibility-capacity index"
            }
        ],
        "openaccessArticle": "true",
        "prism:publicationName": "Advances in Climate Change Research",
        "prism:number": "3",
        "openaccessSponsorType": "Author",
        "prism:pageRange": "142-148",
        "prism:endingPage": "148",
        "pubType": "fla",
        "prism:coverDisplayDate": "September 2014",
        "prism:doi": "10.1016/j.accre.2014.08.001",
        "prism:startingPage": "142",
        "dc:identifier": "doi:10.1016/j.accre.2014.08.001",
        "openaccessSponsorName": null
    },
    "objects": {
        "object": [
            {
                "@category": "thumbnail",
                "@height": "65",
                "@width": "273",
                "@_fa": "true",
                "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1674927814000082-si5.gif?httpAccept=%2A%2F%2A",
                "@multimediatype": "GIF image file",
                "@type": "ALTIMG",
                "@size": "1510",
                "@ref": "si5",
                "@mimetype": "image/gif"
            },
            {
                "@category": "thumbnail",
                "@height": "80",
                "@width": "195",
                "@_fa": "true",
                "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1674927814000082-si4.gif?httpAccept=%2A%2F%2A",
                "@multimediatype": "GIF image file",
                "@type": "ALTIMG",
                "@size": "1377",
                "@ref": "si4",
                "@mimetype": "image/gif"
            },
            {
                "@category": "thumbnail",
                "@height": "17",
                "@width": "165",
                "@_fa": "true",
                "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1674927814000082-si3.gif?httpAccept=%2A%2F%2A",
                "@multimediatype": "GIF image file",
                "@type": "ALTIMG",
                "@size": "566",
                "@ref": "si3",
                "@mimetype": "image/gif"
            },
            {
                "@category": "thumbnail",
                "@height": "41",
                "@width": "333",
                "@_fa": "true",
                "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1674927814000082-si2.gif?httpAccept=%2A%2F%2A",
                "@multimediatype": "GIF image file",
                "@type": "ALTIMG",
                "@size": "1389",
                "@ref": "si2",
                "@mimetype": "image/gif"
            },
            {
                "@category": "thumbnail",
                "@height": "32",
                "@width": "193",
                "@_fa": "true",
                "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1674927814000082-si1.gif?httpAccept=%2A%2F%2A",
                "@multimediatype": "GIF image file",
                "@type": "ALTIMG",
                "@size": "697",
                "@ref": "si1",
                "@mimetype": "image/gif"
            },
            {
                "@category": "standard",
                "@height": "374",
                "@width": "544",
                "@_fa": "true",
                "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1674927814000082-gr1.jpg?httpAccept=%2A%2F%2A",
                "@multimediatype": "JPEG image file",
                "@type": "IMAGE-DOWNSAMPLED",
                "@size": "42651",
                "@ref": "gr1",
                "@mimetype": "image/jpeg"
            },
            {
                "@category": "thumbnail",
                "@height": "150",
                "@width": "219",
                "@_fa": "true",
                "$": "https://api.elsevier.com/content/object/eid/1-s2.0-S1674927814000082-gr1.sml?httpAccept=%2A%2F%2A",
                "@multimediatype": "GIF image file",
                "@type": "IMAGE-THUMBNAIL",
                "@size": "5561",
                "@ref": "gr1",
                "@mimetype": "image/gif"
            }
        ]
    },
    "link": {
        "@rel": "abstract",
        "@href": "https://api.elsevier.com/content/abstract/scopus_id/84933504316"
    }
}