{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [],
   "source": [
    "from pathlib import Path\n",
    "import requests\n",
    "from time import sleep\n",
    "import json\n",
    "import csv\n",
    "import os\n",
    "import sys # Read CLI arguments\n",
    "\n",
    "sparql_sleep = 0.1 # number of seconds to wait between queries to SPARQL endpoint\n",
    "home = str(Path.home()) # gets path to home directory; supposed to work for both Win and Mac\n",
    "sparql_endpoint = 'http://localhost:3030/bluffton/query'\n",
    "update_endpoint = 'http://localhost:3030/bluffton/update'\n",
    "accept_media_type = 'application/json'\n",
    "\n",
    "namespaces = '''\n",
    "prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "prefix prov: <http://www.w3.org/ns/prov#>\n",
    "prefix wikibase: <http://wikiba.se/ontology#>\n",
    "prefix  wd:  <http://www.wikidata.org/entity/>\n",
    "prefix  p:  <http://www.wikidata.org/prop/>\n",
    "prefix  pq:  <http://www.wikidata.org/prop/qualifier/>\n",
    "prefix  pr:  <http://www.wikidata.org/prop/reference/>\n",
    "prefix  ps:  <http://www.wikidata.org/prop/statement/>\n",
    "prefix  pqv:  <http://www.wikidata.org/prop/qualifier/value/>\n",
    "prefix  prv:  <http://www.wikidata.org/prop/reference/value/>\n",
    "prefix  psv:  <http://www.wikidata.org/prop/statement/value/>\n",
    "'''\n",
    "\n",
    "value_types = ['time', 'quantity', 'globecoordinate']\n",
    "\n",
    "def generate_header_dictionary(accept_media_type):\n",
    "    user_agent_header = 'TestBot/0.1 (mailto:steve.baskauf@vanderbilt.edu)'\n",
    "    requestHeaderDictionary = {\n",
    "        'Accept' : accept_media_type,\n",
    "        'Content-Type': 'application/sparql-query',\n",
    "        'User-Agent': user_agent_header\n",
    "    }\n",
    "    return requestHeaderDictionary\n",
    "\n",
    "requestheader = generate_header_dictionary(accept_media_type)\n",
    "\n",
    "def generate_update_header_dictionary():\n",
    "    user_agent_header = 'TestBot/0.1 (mailto:steve.baskauf@vanderbilt.edu)'\n",
    "    requestHeaderDictionary = {\n",
    "        'Content-Type': 'application/sparql-update',\n",
    "        'User-Agent': user_agent_header\n",
    "    }\n",
    "    return requestHeaderDictionary\n",
    "\n",
    "updateheader = generate_update_header_dictionary()\n",
    "\n",
    "# extracts the qNumber from a Wikidata IRI\n",
    "def extract_qnumber(iri):\n",
    "    # pattern is http://www.wikidata.org/entity/Q6386232\n",
    "    pieces = iri.split('/')\n",
    "    return pieces[4]\n",
    "\n",
    "def send_query(query, query_type, endpoint, requestheader):\n",
    "    print('querying SPARQL endpoint to acquire item metadata')\n",
    "    response = requests.post(endpoint, data=query, headers=requestheader)\n",
    "    #print(response.text)\n",
    "    print('done retrieving data')\n",
    "    \n",
    "    if query_type == 'select':\n",
    "        data = response.json()\n",
    "        # extract the values from the response JSON\n",
    "        results = data['results']['bindings']\n",
    "        #print(json.dumps(results, indent=2))\n",
    "    if query_type == 'construct':\n",
    "        data = response.text        \n",
    "    else:\n",
    "        data = response.text\n",
    "    \n",
    "    return(data)\n",
    "\n",
    "def send_update(query, endpoint, requestheader):\n",
    "    #print('sending SPARQL update')\n",
    "    response = requests.post(endpoint, headers=requestheader, data = query)\n",
    "\n",
    "    #print(response.text)\n",
    "    print('update complete')\n",
    "\n",
    "    data = response.text\n",
    "    \n",
    "    return(data)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "sending SPARQL update\n",
      "update complete\n"
     ]
    }
   ],
   "source": [
    "# Test to insert a single triple into the default graph\n",
    "\n",
    "query = '''\n",
    "insert {?s ?p ?o}\n",
    "where {\n",
    "bind(uri(\"http://test_subject\") as ?s)\n",
    "bind(uri(\"http://test_predicate\") as ?p)\n",
    "bind(uri(\"http://test_object\") as ?o)\n",
    "}\n",
    "'''\n",
    "\n",
    "# update test\n",
    "data = send_update(query, update_endpoint, updateheader)\n",
    "# Fuseki doesn't send any response for update commands\n",
    "#print('response:\\n', data)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "update complete\n"
     ]
    }
   ],
   "source": [
    "# Delete all triples in the triplestore\n",
    "query = 'drop all'\n",
    "\n",
    "# update test\n",
    "data = send_update(query, update_endpoint, updateheader)\n",
    "# Fuseki doesn't send any response for update commands\n",
    "#print('response:\\n', data)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "construct {?reference ?directProp ?literal.}\n",
      "\n",
      "where {\n",
      "  ?reference ?pxv ?value.\n",
      "  ?value wikibase:geoLatitude ?literal0.\n",
      "  ?value wikibase:geoLongitude ?literal1.\n",
      "  bind(concat(\"Point(\", str(?literal0), \" \", str(?literal1), \")\") as ?literal)\n",
      "  filter(substr(str(?pxv),1,45)=\"http://www.wikidata.org/prop/statement/value/\")\n",
      "  bind(substr(str(?pxv),46) as ?id)\n",
      "  bind(iri(concat(\"http://www.wikidata.org/prop/statement/\", ?id)) as ?directProp)\n",
      "  }\n",
      "  \n",
      "querying SPARQL endpoint to acquire item metadata\n",
      "done retrieving data\n",
      "@prefix schema: <http://schema.org/> .\n",
      "@prefix pq:    <http://www.wikidata.org/prop/qualifier/> .\n",
      "@prefix pr:    <http://www.wikidata.org/prop/reference/> .\n",
      "@prefix ps:    <http://www.wikidata.org/prop/statement/> .\n",
      "@prefix wikibase: <http://wikiba.se/ontology#> .\n",
      "@prefix xsd:   <http://www.w3.org/2001/XMLSchema#> .\n",
      "@prefix rdfs:  <http://www.w3.org/2000/01/rdf-schema#> .\n",
      "@prefix wd:    <http://www.wikidata.org/entity/> .\n",
      "@prefix p:     <http://www.wikidata.org/prop/> .\n",
      "@prefix psv:   <http://www.wikidata.org/prop/statement/value/> .\n",
      "@prefix pqv:   <http://www.wikidata.org/prop/qualifier/value/> .\n",
      "@prefix rdf:   <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .\n",
      "@prefix prv:   <http://www.wikidata.org/prop/reference/value/> .\n",
      "@prefix prov:  <http://www.w3.org/ns/prov#> .\n",
      "\n",
      "<http://www.wikidata.org/entity/statement/Q86754582-EA0D64DE-9661-41AA-9AE9-812AB2799C39>\n",
      "        ps:P625  \"Point(39.333611 -85.973611)\" .\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Test to construct missing value statements using value node values.\n",
    "\n",
    "# NOTE: The datatypes for xsd:dateTime and xsd:decimal should be generated automatically by the datatype \n",
    "# designation in the csv-metadata.json schema (for integers, a \".0\" is appended to integers to make them decimals).\n",
    "# However, I don't know how to force the geo:wktLiteral datatype in SPARQL construct, so this may end up not matching\n",
    "# the datatype of literals acquired from the Wikidata Query service.\n",
    "\n",
    "value_types = [\n",
    "    {'string': 'time', \n",
    "     'local_names': ['timeValue'], \n",
    "     'datatype':'http://www.w3.org/2001/XMLSchema#dateTime',\n",
    "     'bind': '?literal0'}, \n",
    "    {'string': 'quantity', \n",
    "     'local_names': ['quantityAmount'],\n",
    "     'datatype': 'http://www.w3.org/2001/XMLSchema#decimal',\n",
    "     'bind': '?literal0'}, \n",
    "    {'string': 'globecoordinate', \n",
    "     'local_names': ['geoLatitude', 'geoLongitude'],\n",
    "     'datatype': 'http://www.opengis.net/ont/geosparql#wktLiteral',\n",
    "     'bind': 'concat(\"Point(\", str(?literal0), \" \", str(?literal1), \")\")'}\n",
    "]\n",
    "\n",
    "property_types = ['statement', 'qualifier', 'reference']\n",
    "\n",
    "value_type = value_types[2]\n",
    "property_type = property_types[0]\n",
    "\n",
    "query = '''\n",
    "construct {?reference ?directProp ?literal.}\n",
    "where {\n",
    "  ?reference ?pxv ?value.\n",
    "'''\n",
    "for ln_index in range(len(value_type['local_names'])):\n",
    "    query += '  ?value wikibase:' + value_type['local_names'][ln_index] + ' ?literal' + str(ln_index) + '''.\n",
    "'''\n",
    "query += '  bind(' + value_type['bind'] + ''' as ?literal)\n",
    "'''\n",
    "query += '  filter(substr(str(?pxv),1,45)=\"http://www.wikidata.org/prop/' + property_type + '''/value/\")\n",
    "  bind(substr(str(?pxv),46) as ?id)\n",
    "  bind(iri(concat(\"http://www.wikidata.org/prop/''' + property_type + '''/\", ?id)) as ?directProp)\n",
    "  }\n",
    "  '''\n",
    "print(query) \n",
    "data = send_query(namespaces + query, query.split(' ')[0].lower(), sparql_endpoint, requestheader)\n",
    "print(data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "updating statement time\n",
      "update complete\n",
      "updating qualifier time\n",
      "update complete\n",
      "updating reference time\n",
      "update complete\n",
      "updating statement quantity\n",
      "update complete\n",
      "updating qualifier quantity\n",
      "update complete\n",
      "updating reference quantity\n",
      "update complete\n",
      "updating statement globecoordinate\n",
      "update complete\n",
      "updating qualifier globecoordinate\n",
      "update complete\n",
      "updating reference globecoordinate\n",
      "update complete\n"
     ]
    }
   ],
   "source": [
    "# Insert the missing value statements using values from value nodes\n",
    "\n",
    "# NOTE: The datatypes for xsd:dateTime and xsd:decimal should be generated automatically by the datatype \n",
    "# designation in the csv-metadata.json schema (for integers, a \".0\" is appended to integers to make them decimals).\n",
    "# However, I don't know how to force the geo:wktLiteral datatype in SPARQL construct, so this may end up not matching\n",
    "# the datatype of literals acquired from the Wikidata Query service.\n",
    "\n",
    "value_types = [\n",
    "    {'string': 'time', \n",
    "     'local_names': ['timeValue'], \n",
    "     'datatype':'http://www.w3.org/2001/XMLSchema#dateTime',\n",
    "     'bind': '?literal0'}, \n",
    "    {'string': 'quantity', \n",
    "     'local_names': ['quantityAmount'],\n",
    "     'datatype': 'http://www.w3.org/2001/XMLSchema#decimal',\n",
    "     'bind': '?literal0'}, \n",
    "    {'string': 'globecoordinate', \n",
    "     'local_names': ['geoLatitude', 'geoLongitude'],\n",
    "     'datatype': 'http://www.opengis.net/ont/geosparql#wktLiteral',\n",
    "     'bind': 'concat(\"Point(\", str(?literal0), \" \", str(?literal1), \")\")'}\n",
    "]\n",
    "\n",
    "property_types = ['statement', 'qualifier', 'reference']\n",
    "\n",
    "#value_type = value_types[2]\n",
    "#property_type = property_types[0]\n",
    "\n",
    "for value_type in value_types:\n",
    "    for property_type in property_types:\n",
    "        query = '''\n",
    "        insert {?reference ?directProp ?literal.}\n",
    "        where {\n",
    "          ?reference ?pxv ?value.\n",
    "        '''\n",
    "        for ln_index in range(len(value_type['local_names'])):\n",
    "            query += '  ?value wikibase:' + value_type['local_names'][ln_index] + ' ?literal' + str(ln_index) + '''.\n",
    "        '''\n",
    "        query += '  bind(' + value_type['bind'] + ''' as ?literal)\n",
    "        '''\n",
    "        query += '  filter(substr(str(?pxv),1,45)=\"http://www.wikidata.org/prop/' + property_type + '''/value/\")\n",
    "          bind(substr(str(?pxv),46) as ?id)\n",
    "          bind(iri(concat(\"http://www.wikidata.org/prop/''' + property_type + '''/\", ?id)) as ?directProp)\n",
    "          }\n",
    "          '''\n",
    "        #print(query) \n",
    "        print('updating', property_type, value_type['string'])\n",
    "        data = send_update(namespaces + query, update_endpoint, updateheader)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "construct_query1 = '''\n",
    "construct {?item ?directProp ?value.}\n",
    "#select distinct ?p ?directProp\n",
    "where {\n",
    "  ?item ?p ?statement.\n",
    "  ?statement ?ps ?value.\n",
    "  filter(substr(str(?ps),1,39)=\"http://www.wikidata.org/prop/statement/\")\n",
    "  bind(substr(str(?ps),40) as ?id)\n",
    "#  bind(substr(str(?p),30) as ?id)\n",
    "  bind(iri(concat(\"http://www.wikidata.org/prop/direct/\", ?id)) as ?directProp)\n",
    "  }\n",
    "'''"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "querying SPARQL endpoint to acquire item metadata\n",
      "done retrieving data\n",
      "{ \"head\": {\n",
      "    \"vars\": [ \"qid\" , \"name\" ]\n",
      "  } ,\n",
      "  \"results\": {\n",
      "    \"bindings\": [\n",
      "      { \n",
      "        \"qid\": { \"type\": \"uri\" , \"value\": \"http://www.wikidata.org/entity/Q71157201\" } ,\n",
      "        \"name\": { \"type\": \"literal\" , \"xml:lang\": \"nl\" , \"value\": \"Jane Wood\" }\n",
      "      } ,\n",
      "      { \n",
      "        \"qid\": { \"type\": \"uri\" , \"value\": \"http://www.wikidata.org/entity/Q98569118\" } ,\n",
      "        \"name\": { \"type\": \"literal\" , \"xml:lang\": \"nl\" , \"value\": \"Noah Calvin Hirschy\" }\n",
      "      } ,\n",
      "      { \n",
      "        \"qid\": { \"type\": \"uri\" , \"value\": \"http://www.wikidata.org/entity/Q98569121\" } ,\n",
      "        \"name\": { \"type\": \"literal\" , \"xml:lang\": \"nl\" , \"value\": \"Samuel K. Mosiman\" }\n",
      "      } ,\n",
      "      { \n",
      "        \"qid\": { \"type\": \"uri\" , \"value\": \"http://www.wikidata.org/entity/Q98569123\" } ,\n",
      "        \"name\": { \"type\": \"literal\" , \"xml:lang\": \"nl\" , \"value\": \"Arthur S. Rosenberger\" }\n",
      "      } ,\n",
      "      { \n",
      "        \"qid\": { \"type\": \"uri\" , \"value\": \"http://www.wikidata.org/entity/Q98569125\" } ,\n",
      "        \"name\": { \"type\": \"literal\" , \"xml:lang\": \"nl\" , \"value\": \"Lloyd L. Ramseyer\" }\n",
      "      } ,\n",
      "      { \n",
      "        \"qid\": { \"type\": \"uri\" , \"value\": \"http://www.wikidata.org/entity/Q98569127\" } ,\n",
      "        \"name\": { \"type\": \"literal\" , \"xml:lang\": \"nl\" , \"value\": \"Robert S. Kreider\" }\n",
      "      } ,\n",
      "      { \n",
      "        \"qid\": { \"type\": \"uri\" , \"value\": \"http://www.wikidata.org/entity/Q98569129\" } ,\n",
      "        \"name\": { \"type\": \"literal\" , \"xml:lang\": \"nl\" , \"value\": \"Benjamin Sprunger\" }\n",
      "      } ,\n",
      "      { \n",
      "        \"qid\": { \"type\": \"uri\" , \"value\": \"http://www.wikidata.org/entity/Q98569132\" } ,\n",
      "        \"name\": { \"type\": \"literal\" , \"xml:lang\": \"nl\" , \"value\": \"Elmer Neufeld\" }\n",
      "      } ,\n",
      "      { \n",
      "        \"qid\": { \"type\": \"uri\" , \"value\": \"http://www.wikidata.org/entity/Q98569134\" } ,\n",
      "        \"name\": { \"type\": \"literal\" , \"xml:lang\": \"nl\" , \"value\": \"Lee F. Snyder\" }\n",
      "      } ,\n",
      "      { \n",
      "        \"qid\": { \"type\": \"uri\" , \"value\": \"http://www.wikidata.org/entity/Q98569136\" } ,\n",
      "        \"name\": { \"type\": \"literal\" , \"xml:lang\": \"nl\" , \"value\": \"James M. Harder\" }\n",
      "      }\n",
      "    ]\n",
      "  }\n",
      "}\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "subquery = '''\n",
    "  ?qid rdfs:label ?name.\n",
    "  ?qid p:P108 ?statement1.\n",
    "  ?statement1 ps:P108  wd:Q886141 .\n",
    "  ?qid p:P39 ?statement2.\n",
    "  ?statement2 ps:P39 wd:Q61061.\n",
    "'''\n",
    "\n",
    "query = '''\n",
    "SELECT distinct ?qid ?name\n",
    "WHERE {\n",
    "  SERVICE <https://query.wikidata.org/sparql> {''' + subquery + '''}\n",
    "  minus\n",
    "{''' + subquery + '''}\n",
    "}\n",
    "'''\n",
    "\n",
    "# ----------------\n",
    "# send request to Fuseki endpoint\n",
    "# ----------------\n",
    "data = send_query(namespaces + query, query.split(' ')[0].lower(), sparql_endpoint, requestheader)\n",
    "print(data)\n",
    "\n",
    "'''\n",
    "print('querying SPARQL endpoint to acquire item metadata')\n",
    "response = requests.post(endpoint, data=query, headers=requestheader)\n",
    "#print(response.text)\n",
    "data = response.json()\n",
    "\n",
    "# extract the values from the response JSON\n",
    "results = data['results']['bindings']\n",
    "\n",
    "print('done retrieving data')\n",
    "print(json.dumps(results, indent=2))\n",
    "\n",
    "# ----------------\n",
    "# extract results\n",
    "# ----------------\n",
    "\n",
    "metadata_list = []\n",
    "for result in results:\n",
    "    row_dict = {}\n",
    "    row_dict['qid'] = extract_qnumber(result['qid']['value'])\n",
    "    row_dict['name'] = result['name']['value']\n",
    "    metadata_list.append(row_dict)\n",
    "\n",
    "print(json.dumps(metadata_list, indent=2))\n",
    "'''\n",
    "print()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
